[
    {
        "title": "Man convicted of attempting to assassinate Trump sentenced to life",
        "url": "https://www.reuters.com/legal/government/man-convicted-attempting-assassinate-trump-be-sentenced-2026-02-04/",
        "content": "Jumpstart your morning with the latest legal news delivered straight to your inbox from The Daily Docket newsletter. Sign up here. Reporting by Jack Queen in Fort Pierce, Florida; Editing by Will Dunham and Rod Nickel Our Standards: The Thomson Reuters Trust Principles.\n, opens new tab Thomson Reuters Jack Queen covers major lawsuits against the Trump administration involving urgent questions of executive power and how their resolution could affect the law and the legal profession in the years to come. Previously, he covered criminal and civil cases against Trump during the interim of his presidential terms, including gavel-to-gavel coverage of his historic hush money trial in New York and his civil fraud trial, which ended in a half-billion-dollar judgment. Jack has also covered high-profile defamation cases including the Dominion Voting Systems' lawsuit against Fox News, which settled for $787 million after intense pretrial litigation. Based in New York, he specializes in breaking news as well as analysis, explainers and other explanatory reporting.",
        "image": "None",
        "scraped_at": "2026-02-05 16:40:11"
    },
    {
        "title": "US Justice Department removes lawyer who told judge in immigration case, 'This job sucks'",
        "url": "https://www.reuters.com/legal/government/us-justice-department-removes-lawyer-who-told-judge-immigration-case-this-job-2026-02-04/",
        "content": "Jumpstart your morning with the latest legal news delivered straight to your inbox from The Daily Docket newsletter. Sign up here. Reporting by Nate Raymond in Boston and Andrew Goudsward in Washington; Editing by Peter Graff and Cynthia Osterman Our Standards: The Thomson Reuters Trust Principles.\n, opens new tab Thomson Reuters Nate Raymond reports on the federal judiciary and litigation. He can be reached at nate.raymond@thomsonreuters.com.",
        "image": "legal_1.jpg",
        "scraped_at": "2026-02-05 16:40:22"
    },
    {
        "title": "Georgia's Fulton County challenges seizure of election records",
        "url": "https://www.reuters.com/world/us/georgias-fulton-county-challenges-seizure-election-records-2026-02-04/",
        "content": "Fulton County commissioner Marvin Arrington Jr. poses in his office in College Park, Georgia, February 2, 2026. REUTERS/Jayla Whitfield-Anderson Purchase Licensing Rights\n, opens new tab WASHINGTON, Feb 4 (Reuters) - Georgia's Fulton County filed a challenge on Wednesday to the legality of a warrant and seizure of election records in of an election facility last week, seeking the return of all confiscated files and the unsealing of a related affidavit.",
        "image": "legal_2.jpg",
        "scraped_at": "2026-02-05 16:41:21"
    },
    {
        "title": "US appeals court weighs Trump policy allowing swift deportations to third countries",
        "url": "https://www.reuters.com/legal/government/us-appeals-court-weighs-trump-policy-allowing-swift-deportations-third-countries-2026-02-03/",
        "content": "The exterior of John Jospeh Moakley U.S. Courthouse, where Alec Burlakoff, former vice president of sales at Insys, appears in federal court after reaching a plea deal with prosecutors, in Boston, Massachusetts, U.S., November 28, 2018. REUTERS/Katherine Taylor Purchase Licensing Rights\n, opens new tab",
        "image": "legal_3.jpg",
        "scraped_at": "2026-02-05 16:41:49"
    },
    {
        "title": "Judge fines lawyers $12,000 over AI-generated submissions in patent case",
        "url": "https://www.reuters.com/legal/litigation/judge-fines-lawyers-12000-over-ai-generated-submissions-patent-case-2026-02-03/",
        "content": "Figurines with computers and smartphones are seen in front of the words \"Artificial Intelligence AI\" in this illustration taken, February 19, 2024. REUTERS/Dado Ruvic/Illustration/File Photo Purchase Licensing Rights\n, opens new tab Feb 3 (Reuters) - A Kansas federal judge has fined lawyers representing a patent holding company a combined $12,000 for filing documents with non-existent quotations and case citations that were generated by artificial intelligence, in the latest instance of lawyers facing sanctions for submitting “hallucinated” material in court.",
        "image": "legal_4.jpg",
        "scraped_at": "2026-02-05 16:42:05"
    },
    {
        "title": "Texas prosecutor who backed Trump's immigration agenda elevated to bench",
        "url": "https://www.reuters.com/legal/government/texas-prosecutor-who-backed-trumps-immigration-agenda-elevated-bench-2026-02-03/",
        "content": "U.S. Attorney Nicholas Ganjei in Houston, Texas, appears in an official headshot. U.S. Attorney's Office for the Southern District of Texas/Handout via REUTERS Purchase Licensing Rights\n, opens new tab Feb 3 (Reuters) - The U.S. Senate on Tuesday elevated two top federal prosecutors in Arkansas and Texas to the federal bench, including one who has aggressively sought to carry out President Donald Trump's hardline immigration agenda at the border as a U.S. Attorney. The Republican-led Senate voted 51-45 in favor of U.S. Attorney Nicholas Ganjei of the Southern District of Texas becoming a life-tenured judge in his district, overcoming opposition from Democrats who criticized his embrace of Trump's immigration enforcement agenda.",
        "image": "legal_5.jpg",
        "scraped_at": "2026-02-05 16:42:28"
    },
    {
        "title": "Nike facing US probe over alleged discrimination against white workers",
        "url": "https://www.reuters.com/sustainability/society-equity/nike-facing-us-probe-over-alleged-discrimination-against-white-workers-2026-02-04/",
        "content": "People walk past a Nike store in New York City, U.S., April 2, 2025. REUTERS/Kylie Cooper/File Photo Purchase Licensing Rights\n, opens new tab Feb 4 (Reuters) - The U.S. agency that enforces laws banning workplace discrimination said in a court filing on Wednesday it is investigating Nike\nfor allegedly discriminating against white people through its diversity policies.",
        "image": "legal_6.jpg",
        "scraped_at": "2026-02-05 16:43:08"
    }
]